{
  "sponsorCategories": {
    "primary": {
      "title": "Primary Partners",
      "sponsors": [
        {
          "id": "silverstone",
          "name": "Silverstone",
          "website": "https://www.silverstone.co.uk/",
          "logo": "/images/sponsors/silverstone.png",
          "description": "The legendary home of British motorsport and our title sponsor. Silverstone Circuit has been supporting our journey from the very beginning, providing us with the inspiration and backing to compete at the highest level. Their commitment to nurturing the next generation of motorsport talent aligns perfectly with our mission.",
          "tier": "primary"
        },
        {
          "id": "dla-town-planning",
          "name": "DLA Town Planning",
          "website": "https://dlatownplanning.com/",
          "logo": "/images/sponsors/dla-town-planning.png",
          "description": "Leading planning consultancy providing expert advice across the UK. DLA Town Planning has been instrumental in supporting our Professional division campaign, helping us plan our route to success with the same precision they bring to their planning projects.",
          "tier": "primary"
        }
      ]
    },
    "secondary": {
      "title": "Supporting Partners",
      "sponsors": [
        {
          "id": "meyer-sound",
          "name": "Meyer Sound",
          "website": "https://meyersound.com/",
          "logo": "/images/sponsors/meyer-sound.png",
          "description": "World-leading professional audio manufacturer. Meyer Sound's MM-4XPD speakers were crucial to our award-winning pit display at UK National Finals. Their cutting-edge audio technology helped create the immersive experience that earned us Best Pit Display.",
          "tier": "secondary"
        },
        {
          "id": "nicab",
          "name": "Nicab",
          "website": "https://nicab.co.uk/",
          "logo": "/images/sponsors/nicab.png",
          "description": "Specialist electrical and automation solutions provider. Nicab's expertise in precision engineering and automation aligns with our commitment to technical excellence in every aspect of our racing programme.",
          "tier": "secondary"
        },
        {
          "id": "figment-productions",
          "name": "Figment Productions",
          "website": "https://figmentproductions.co.uk/",
          "logo": "/images/sponsors/figment-productions.png",
          "description": "Creative production company specialising in innovative digital content. Figment Productions has helped elevate our brand presence and storytelling, bringing our racing journey to life through compelling visual content.",
          "tier": "secondary"
        },
        {
          "id": "twoeighty",
          "name": "TwoEighty",
          "website": "https://www.twoeighty.co.uk/",
          "logo": "/images/sponsors/twoeighty.png",
          "description": "Our dedicated sustainability consultant helping us achieve carbon neutrality. Through our partnership with TwoEighty, we've offset over two tons of carbon and planted two trees, making us 100% carbon neutral in motorsport competition.",
          "tier": "secondary"
        }
      ]
    },
    "supporting": {
      "title": "Technical Partners",
      "sponsors": [
        {
          "id": "techbridge",
          "name": "Techbridge",
          "website": "https://www.techbridgeldn.com/",
          "logo": "/images/sponsors/techbridge.png",
          "description": "Technology solutions provider connecting innovation with practical application. Techbridge supports our technical development and helps bridge the gap between cutting-edge design and real-world performance.",
          "tier": "supporting"
        },
        {
          "id": "avea",
          "name": "AVEA",
          "website": null,
          "logo": "/images/sponsors/avea.png",
          "description": "Valued technical partner supporting our engineering initiatives. AVEA's contribution to our programme demonstrates the importance of collaborative partnerships in achieving motorsport excellence.",
          "tier": "supporting"
        },
        {
          "id": "newport-cnc",
          "name": "Newport CNC",
          "website": "https://www.newport-cnc.com/",
          "logo": "/images/sponsors/newport-cnc.png",
          "description": "Precision CNC machining specialists providing manufacturing expertise. Newport CNC's advanced machining capabilities are essential to producing the high-quality components that make our RR3 car competitive at professional level.",
          "tier": "supporting"
        }
      ]
    }
  }
}